# 1층 1호에살면 -> 0층의 1호에서 1호까지 => 1 1층 2호 => 3명, 1층 3호 => 6명, 1층 4호 -> 10명 //
# 2층 1호 -> 1명, 2층 2호 -> 4명, 2층 3호 -> 10명 2층 4호 -> 20명
# 3층 1호 -> 1명, 3층 2호 -> 5명, 3층 3호 -> 15명 3층 4호 -> 35명
# 1 2 3 4 5 ... 0층
# 1 3 6 10 15   1층
# 1 4 10 20 35  2층
# 1 5 15 35 70  3층
# 0 1 (3,4,5), (6,10,15), (10,20,35)

# n = int(input())
# sum = [] # 처음 0층 값을 1에서 14로 줘버리는게 어떨까?
# zero = [1,2,3,4,5,6,7,8,9,10,11,12,13,14]

# k n => (k-1 n) + (k n-1)

for _ in range(int(input())):
    k = int(input())
    n = int(input())
    a = [i for i in range(1, n + 1)]
    for _ in range(k):
        for j in range(1,n):
            a[j]+=a[j - 1]

    print(a[n - 1])

    print(a)


    # sum.append([])

